ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/CONTROLSS_OUTPUTXBAR_CONTROLSS_502D8000h.xml
	</register><register id="CONTROLSS_OUTPUTXBAR10_G2" acronym="CONTROLSS_OUTPUTXBAR10_G2" offset="904" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR10 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G3" acronym="CONTROLSS_OUTPUTXBAR10_G3" offset="908" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR10 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0: DEL[x] ACTIVE is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G4" acronym="CONTROLSS_OUTPUTXBAR10_G4" offset="912" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR10 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0: DEL[x] TRIP is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G5" acronym="CONTROLSS_OUTPUTXBAR10_G5" offset="916" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR10 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G6" acronym="CONTROLSS_OUTPUTXBAR10_G6" offset="920" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR10 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G7" acronym="CONTROLSS_OUTPUTXBAR10_G7" offset="924" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR10 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G8" acronym="CONTROLSS_OUTPUTXBAR10_G8" offset="928" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G8_SEL" width="28" begin="27" end="0" resetval="0x0" description="G8: OUTPUT XBAR10 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT420:ADCR0.EVT121:ADCR0.EVT222:ADCR0.EVT323:ADCR0.EVT424:ADCR1.EVT125:ADCR1.EVT226:ADCR1.EVT327:ADCR1.EVT4" range="27:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G9" acronym="CONTROLSS_OUTPUTXBAR10_G9" offset="932" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G9_SEL" width="26" begin="25" end="0" resetval="0x0" description="G9: OUTPUT XBAR10 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT 20:ECAP10.OUT21:ECAP11.OUT22:ECAP12.OUT23:ECAP13.OUT24:ECAP14.OUT25:ECAP15.OUT" range="25:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G10" acronym="CONTROLSS_OUTPUTXBAR10_G10" offset="936" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G10_SEL" width="22" begin="21" end="0" resetval="0x0" description="G10: OUTPUT XBAR10 G10 Input Select[3:0]: FSIRX0.RX_TRIG[3:0][7:4]: FSIRX1.RX_TRIG[3:0][11:8]: FSIRX2.RX_TRIG[3:0][15:12]: FSIRX3.RX_TRIG[3:0]16:INPUTXBAR.OUT717:INPUTXBAR.OUT1518:INPUTXBAR.OUT2319:INPUTXBAR.OUT3120:INTXBAR.OUT721:INTXBAR.OUT15" range="21:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G0" acronym="CONTROLSS_OUTPUTXBAR11_G0" offset="960" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR11 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G1" acronym="CONTROLSS_OUTPUTXBAR11_G1" offset="964" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR11 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G2" acronym="CONTROLSS_OUTPUTXBAR11_G2" offset="968" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR11 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G3" acronym="CONTROLSS_OUTPUTXBAR11_G3" offset="972" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR11 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0: DEL[x] ACTIVE is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G4" acronym="CONTROLSS_OUTPUTXBAR11_G4" offset="976" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR11 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0: DEL[x] TRIP is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G5" acronym="CONTROLSS_OUTPUTXBAR11_G5" offset="980" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR11 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G6" acronym="CONTROLSS_OUTPUTXBAR11_G6" offset="984" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR11 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G7" acronym="CONTROLSS_OUTPUTXBAR11_G7" offset="988" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR11 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G8" acronym="CONTROLSS_OUTPUTXBAR11_G8" offset="992" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G8_SEL" width="28" begin="27" end="0" resetval="0x0" description="G8: OUTPUT XBAR11 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT420:ADCR0.EVT121:ADCR0.EVT222:ADCR0.EVT323:ADCR0.EVT424:ADCR1.EVT125:ADCR1.EVT226:ADCR1.EVT327:ADCR1.EVT4" range="27:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G9" acronym="CONTROLSS_OUTPUTXBAR11_G9" offset="996" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G9_SEL" width="26" begin="25" end="0" resetval="0x0" description="G9: OUTPUT XBAR11 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT 20:ECAP10.OUT21:ECAP11.OUT22:ECAP12.OUT23:ECAP13.OUT24:ECAP14.OUT25:ECAP15.OUT" range="25:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G10" acronym="CONTROLSS_OUTPUTXBAR11_G10" offset="1000" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G10_SEL" width="22" begin="21" end="0" resetval="0x0" description="G10: OUTPUT XBAR11 G10 Input Select[3:0]: FSIRX0.RX_TRIG[3:0][7:4]: FSIRX1.RX_TRIG[3:0][11:8]: FSIRX2.RX_TRIG[3:0][15:12]: FSIRX3.RX_TRIG[3:0]16:INPUTXBAR.OUT717:INPUTXBAR.OUT1518:INPUTXBAR.OUT2319:INPUTXBAR.OUT3120:INTXBAR.OUT721:INTXBAR.OUT15" range="21:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G0" acronym="CONTROLSS_OUTPUTXBAR12_G0" offset="1024" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR12 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G1" acronym="CONTROLSS_OUTPUTXBAR12_G1" offset="1028" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR12 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G2" acronym="CONTROLSS_OUTPUTXBAR12_G2" offset="1032" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR12 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G3" acronym="CONTROLSS_OUTPUTXBAR12_G3" offset="1036" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR12 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0: DEL[x] ACTIVE is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G4" acronym="CONTROLSS_OUTPUTXBAR12_G4" offset="1040" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR12 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0: DEL[x] TRIP is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G5" acronym="CONTROLSS_OUTPUTXBAR12_G5" offset="1044" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR12 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G6" acronym="CONTROLSS_OUTPUTXBAR12_G6" offset="1048" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR12 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G7" acronym="CONTROLSS_OUTPUTXBAR12_G7" offset="1052" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR12 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G8" acronym="CONTROLSS_OUTPUTXBAR12_G8" offset="1056" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G8_SEL" width="28" begin="27" end="0" resetval="0x0" description="G8: OUTPUT XBAR12 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT420:ADCR0.EVT121:ADCR0.EVT222:ADCR0.EVT323:ADCR0.EVT424:ADCR1.EVT125:ADCR1.EVT226:ADCR1.EVT327:ADCR1.EVT4" range="27:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G9" acronym="CONTROLSS_OUTPUTXBAR12_G9" offset="1060" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G9_SEL" width="26" begin="25" end="0" resetval="0x0" description="G9: OUTPUT XBAR12 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT 20:ECAP10.OUT21:ECAP11.OUT22:ECAP12.OUT23:ECAP13.OUT24:ECAP14.OUT25:ECAP15.OUT" range="25:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR12_G10" acronym="CONTROLSS_OUTPUTXBAR12_G10" offset="1064" width="32" description="OUTPUT XBAR 12 Input Select.">
		<bitfield id="OUTPUTXBAR12_G10_SEL" width="22" begin="21" end="0" resetval="0x0" description="G10: OUTPUT XBAR12 G10 Input Select[3:0]: FSIRX0.RX_TRIG[3:0][7:4]: FSIRX1.RX_TRIG[3:0][11:8]: FSIRX2.RX_TRIG[3:0][15:12]: FSIRX3.RX_TRIG[3:0]16:INPUTXBAR.OUT717:INPUTXBAR.OUT1518:INPUTXBAR.OUT2319:INPUTXBAR.OUT3120:INTXBAR.OUT721:INTXBAR.OUT15" range="21:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G0" acronym="CONTROLSS_OUTPUTXBAR13_G0" offset="1088" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR13 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G1" acronym="CONTROLSS_OUTPUTXBAR13_G1" offset="1092" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR13 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G2" acronym="CONTROLSS_OUTPUTXBAR13_G2" offset="1096" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR13 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G3" acronym="CONTROLSS_OUTPUTXBAR13_G3" offset="1100" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR13 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0: DEL[x] ACTIVE is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G4" acronym="CONTROLSS_OUTPUTXBAR13_G4" offset="1104" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR13 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0: DEL[x] TRIP is de-selected x can have value from 0 to 31 corresponding to each DEL instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G5" acronym="CONTROLSS_OUTPUTXBAR13_G5" offset="1108" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR13 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G6" acronym="CONTROLSS_OUTPUTXBAR13_G6" offset="1112" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR13 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G7" acronym="CONTROLSS_OUTPUTXBAR13_G7" offset="1116" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR13 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G8" acronym="CONTROLSS_OUTPUTXBAR13_G8" offset="1120" width="32" description="OUTPUT XBAR 13 Input Select.">
		<bitfield id="OUTPUTXBAR13_G8_SEL" width="28" begin="27" end="0" resetval="0x0" description="G8: OUTPUT XBAR13 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT420:ADCR0.EVT121:ADCR0.EVT222:ADCR0.EVT323:ADCR0.EVT424:ADCR1.EVT125:ADCR1.EVT226:ADCR1.EVT327:ADCR1.EVT4" range="27:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR13_G9" acronym="CONTROLSS_OUTPUTXBAR13_G9" offset="1124" width="32" description="OUTPUT XBAR 13 Input Select.">
